[
    {
        "id": "1",
        "slug": "duvidas-sobre-organizacao-de-codigo-em-python",
        "created_at": "2025-09-11T15:20:30.123Z",
        "author": {
            "username": "devuser123"
        },
        "tags": [
            "Python",
            "Boas Práticas"
        ],
        "title": "Dúvidas sobre organização de código em Python",
        "body": "Estou começando a criar projetos maiores em Python e percebi que meus arquivos estão ficando confusos. Devo separar tudo em módulos? Como saber quando criar uma classe?\n\nSe tiverem dicas de boas práticas ou referências, agradeço!",
        "boosts": {
            "count": 5,
            "reacted": false
        },
        "solved": true,
        "reactions": [
            {
                "emoji": "👍",
                "count": 3,
                "reacted": false
            },
            {
                "emoji": "💡",
                "count": 1,
                "reacted": false
            }
        ],
        "comments": [
            {
                "id": "8",
                "created_at": "2025-09-11T16:00:00.000Z",
                "author": {
                    "username": "pythonista"
                },
                "body": "Uma boa prática é seguir o princípio da responsabilidade única: cada módulo ou classe deve ter uma única responsabilidade. Isso facilita a manutenção e a leitura do código. Além disso, usar pacotes para agrupar módulos relacionados pode ajudar na organização.",
                "boosts": {
                    "count": 2,
                    "reacted": false
                }
            }
        ]
    },
    {
        "id": "2",
        "slug": "tentando-construir-um-pedaco-de-internet-mais-massa",
        "created_at": "2025-09-10T20:43:55.883Z",
        "author": {
            "username": "jvopinho"
        },
        "tags": [
            "Coffee Hub"
        ],
        "title": "Tentando construir um pedaço de internet mais massa",
        "body": "Não sei se você compartilha a sensação de que, recentemente, a internet deixou de ser um lugar massa — principalmente em sites onde o conteudo principal é texto. Tudo parece virar ruído: propaganda demais, oferta demais. Ao navegar, dá a impressão de que você é uma presa cercada por predadores, enquanto tenta extrair algum valor no meio da confusão.\n\nDesde já: não sou contra propaganda, ofertas ou marketing. Produtos e serviços precisam de visibilidade para se mantérem e projetos na internet precisam ser viáveis. Caso contrário, é só uma questão de tempo até desaparecerem.\n\nMas essa visão é dura e reconheço que redes sociais têm muitos usos — entretenimento, lazer, socialização — e isso não é o que buscamos aqui no Coffee Hub.\n\n## Conteúdos com valor concreto para quem trabalha com tecnologia\n\nQuem leva tecnologia a sério precisa de conteúdo que entregue valor real. O objetivo do **Coffee Hub** é remar contra a maré das redes sociais e resgatar o espírito dos fóruns de antigamente, onde threads e respostas traziam conhecimento de verdade.\n\nNesses espaços, respostas frequentemente tinham tanto (ou mais) valor que o post original. Para que isso aconteça, a plataforma precisa oferecer espaço igual para autores e respondentes — aqui cada resposta é tratada como conteúdo e recebe seu próprio link e página.\n\nQueremos desencorajar comentários vazios como \"valeu!\" e incentivar contribuições que devolvam valor prático. Quando isso não for possível, existe a alternativa de reconhecer o autor com **Coffee Beans**.\n\n## Coffee Beans\n\nDiferente de plataformas que permitem comprar moedas virtuais, o Coffee Hub não venderá Coffee Beans, a única forma de obtê-las é gerando valor real: publicando notícias, artigos, perguntas, tutoriais ou comentários relevantes.\n\nVocê ganha moedas ao criar conteúdo e também quando outras pessoas acreditam que o seu conteúdo tem valor e decidem recompensá-lo. Isso torna a sinalização de qualidade mais significativa — cada reconhecimento carrega um custo real, porque as moedas são limitadas e conquistadas.\n\nMas como garantir que isso não vire apenas trabalho não remunerado? Essa é a próxima conversa — e é nela que explicamos como o valor pode voltar para quem cria conteúdo.",
        "boosts": {
            "count": 16,
            "reacted": true
        },
        "reactions": [
            {
                "emoji": "👏",
                "count": 15,
                "reacted": false
            },
            {
                "emoji": "👍",
                "count": 2,
                "reacted": true
            }
        ],
        "comments": [
            {
                "id": "3",
                "created_at": "2025-09-10T22:43:55.883Z",
                "author": {
                    "username": "victorpantarotti"
                },
                "body": "Que ideia fantástica! Deu gosto de ler tudo do início ao fim. Espero que esse projeto cresça muito e tenha a efetividade maior do que o esperado. Acho muito massa essa iniciativa da comunidade para a comunidade, se parece com a ideia do DEV Community.",
                "boosts": {
                    "count": 0,
                    "reacted": false
                }
            },
            {
                "id": "4",
                "created_at": "2025-09-10T22:43:55.883Z",
                "author": {
                    "username": "ryanhrc"
                },
                "body": "So pela apresentação ja da pra ter uma ideia que sera muito massa ter um pedaço de internet mais massa. Fico agradecido pela criação e com certeza ajudará muitos",
                "boosts": {
                    "count": 0,
                    "reacted": false
                }
            }
        ]
    },
    {
        "id": "11",
        "slug": "diferenca-entre-for-in-e-for-of-no-javascript",
        "created_at": "2025-09-10T10:15:00.000Z",
        "author": {
            "username": "jsnovato"
        },
        "tags": [
            "JavaScript",
            "Typescript",
            "Dicas"
        ],
        "title": "Diferença entre for...in e for...of no JavaScript",
        "body": "Muitos iniciantes confundem `for…in` e `for…of`. Apesar de parecidos, eles têm finalidades diferentes:\n- **for…in** → itera sobre chaves (índices ou propriedades),\n- **for…of** → itera sobre valores\n**Exemplo:**\n\n```javascript\nconst arr = ['a', 'b', 'c'];\n\nfor (let index in arr) {\n  console.log(index); // 0, 1, 2\n}\n\nfor (let value of arr) {\n  console.log(value); // 'a', 'b', 'c'\n}\n```\n\nUse **for…in** para objetos e **for…of** para arrays e outros iteráveis.",
        "boosts": {
            "count": 10,
            "reacted": false
        },
        "reactions": [
            {
                "emoji": "💡",
                "count": 6,
                "reacted": true
            },
            {
                "emoji": "📚",
                "count": 3,
                "reacted": false
            }
        ],
        "comments": []
    },
    {
        "id": "5",
        "slug": "como-melhorar-minha-eficiencia-no-trabalho",
        "created_at": "2025-09-09T18:15:42.567Z",
        "author": {
            "username": "produtividadeguru"
        },
        "tags": [
            "Produtividade",
            "Dicas"
        ],
        "title": "Como melhorar minha eficiência no trabalho?",
        "body": "Sinto que estou sempre correndo contra o tempo e nunca consigo terminar tudo o que preciso fazer. Alguém tem dicas práticas para melhorar a eficiência no trabalho e gerenciar melhor o tempo?",
        "boosts": {
            "count": 8,
            "reacted": false
        },
        "reactions": [
            {
                "emoji": "⏰",
                "count": 4,
                "reacted": false
            },
            {
                "emoji": "💼",
                "count": 2,
                "reacted": false
            }
        ],
        "comments": [
            {
                "id": "6",
                "created_at": "2025-09-09T19:00:00.000Z",
                "author": {
                    "username": "timewizard"
                },
                "body": "Uma técnica que me ajudou bastante foi a Pomodoro. Trabalho por 25 minutos focado e depois faço uma pausa de 5 minutos. Isso ajuda a manter a concentração e evita o cansaço mental.",
                "boosts": {
                    "count": 1,
                    "reacted": false
                }
            }
        ]
    },
    {
        "id": "7",
        "slug": "ferramentas-essenciais-para-desenvolvedores-web",
        "created_at": "2025-09-08T14:30:10.789Z",
        "author": {
            "username": "webdevmaster"
        },
        "tags": [
            "Desenvolvimento Web",
            "Ferramentas"
        ],
        "title": "Ferramentas essenciais para desenvolvedores web",
        "body": "Quais são as ferramentas que vocês consideram essenciais para o dia a dia de um desenvolvedor web? Estou buscando otimizar meu fluxo de trabalho e gostaria de saber as recomendações da comunidade.",
        "boosts": {
            "count": 12,
            "reacted": true
        },
        "reactions": [
            {
                "emoji": "🛠️",
                "count": 7,
                "reacted": false
            },
            {
                "emoji": "💻",
                "count": 5,
                "reacted": true
            }
        ],
        "comments": []
    }
]